print('Выберите тип задачи:\n1.Численное интегрирование')
print('Введите число:')

type = int(input())
match type:
    case 1:
        print('Какой метод численного интегрирования вы выберите: '
              '\n 1.Метод прямоугольников левых частей '
              '\n 2.Метод прямоугольников правых частей '
              '\n 3.Метод трапеций '
              '\n 4.Метод парабол')
        print('Введите число:')
        method = int(input())
        match method:
            case 1:
                print('Вы выбрали метод прямоугольников левых частей')
                print('Выберите алгоритм работы: \n 1.Алгоритм с постоянным шагом \n 2.Алгоритм с переменным шагом')
                print('Введите число')
                algorithm = int(input())
                match algorithm:
                    case 1:
                        print('Вы выбрали алгоритм с постоянным шагом')
                    case 2:
                        print('Вы выбрали алгоритм с переменным шагом')
            case 2:
                print('Вы выбрали метод прямоугольников правых частей')
                print('Выберите алгоритм работы: \n 1.Алгоритм с постоянным шагом \n 2.Алгоритм с переменным шагом')
                print('Введите число')
                algorithm = int(input())
                match algorithm:
                    case 1:
                        print('Вы выбрали алгоритм с постоянным шагом')
                    case 2:
                        print('Вы выбрали алгоритм с переменным шагом')
            case 3:
                print('Вы выбрали метод трапеций')
                print('Выберите алгоритм работы: \n 1.Алгоритм с постоянным шагом \n 2.Алгоритм с переменным шагом')
                print('Введите число')
                algorithm = int(input())
                match algorithm:
                    case 1:
                        print('Вы выбрали алгоритм с постоянным шагом')
                    case 2:
                        print('Вы выбрали алгоритм с переменным шагом')
            case 4:
                print('Вы выбрали метод парабол')
                print('Выберите алгоритм работы: \n 1.Алгоритм с постоянным шагом \n 2.Алгоритм с переменным шагом')
                print('Введите число')
                algorithm = int(input())
                match algorithm:
                    case 1:
                        print('Вы выбрали алгоритм с постоянным шагом')
                    case 2:
                        print('Вы выбрали алгоритм с переменным шагом')